spec/fixtures/subscription_periods/get.json

{
  "id": "SPCMTC4RJLPNWT",
  "type": "subscription_period",
  "amount": 5000,
  "created_at": "2023-12-11T15:31:14Z",
  "payments": {
    "type": "list",
    "count": 1,
    "data": [
      {
        "id": "PPSKN6FAN8KNE1",
        "type": "payment",
        "amount": 1950,
        "cancel_url": null,
        "created_at": "2023-12-11T15:31:14Z",
        "currency": "EUR",
        "description": "Unlimited Subscription",
        "paid_at": "2023-12-11T15:31:44Z",
        "pay_method": {
          "id": "ideal",
          "name": "iDEAL",
          "type": "pay_method"
        },
        "refunded_amount": 0,
        "return_url": null,
        "state": "paid",
        "_links": {
          "self": "https://api.paypro.nl/payments/PPSKN6FAN8KNE1"
        }
      }
    ],
    "_links": {
      "self": "https://api.paypro.nl/subscription_periods/SPCMTC4RJLPNWT/payments"
    }
  },
  "period_number": 1,
  "state": "paid",
  "subscription": "PS8PTGUPZTSLBP",
  "_links": {
    "self": "https://api.paypro.nl/subscription_periods/SPCMTC4RJLPNWT",
    "subscription": "https://api.paypro.nl/subscriptions/PS8PTGUPZTSLBP"
  }
}
